<?php

class ModuleSettings extends Module
{
    //-- Версия модуля
    public static string $version = '1.4';

    //-- Дата
    public static string $date = '18.12.2017';

    //-- Системное имя модуля
    public static string $moduleName = 'settings';


    public function __construct()
    {
        //-- Родитель
        parent::__construct();


        /*
        |--------------------------------------------------------------------------------------
        | Назначаем права
        |--------------------------------------------------------------------------------------
        |
        */
        Permission::add('settings', ['settings_view', 'settings_edit'], 'mdi mdi-cogs', 70);


        /*
        |--------------------------------------------------------------------------------------
        | Инстанс Smarty
        |--------------------------------------------------------------------------------------
        |
        */
        $Template = Template::getInstance();


        /*
        |--------------------------------------------------------------------------------------
        | Подгружаем файл переводов
        |--------------------------------------------------------------------------------------
        |
        */
        $Template->_load(DASHBOARD_DIR . '/app/modules/settings/i18n/' . $_SESSION['current_language'] . '.ini', 'name');


        /*
        |--------------------------------------------------------------------------------------
        | Подгружаем файл переводов (Права)
        |--------------------------------------------------------------------------------------
        |
        */
        $Template->_load(DASHBOARD_DIR . '/app/modules/settings/i18n/' . Session::getvar('current_language') . '.ini', 'permissions');


        /*
        |--------------------------------------------------------------------------------------
        | Добавляем подменю навигации
        |--------------------------------------------------------------------------------------
        |
        */
        Navigation::add(
            30,
            $Template->_get('settings_menu_name'),
            'mdi mdi-cogs',
            ABS_PATH . 'settings',
            'settings',
            Navigation::SIDEBAR,
            Navigation::SIDEBAR_SETTINGS,
            '',
            '',
            false
        );
    }
}
